### Тема “Работа с данными в Pandas”

### task_1

In [1]:
import pandas as pd

In [2]:
data = {'author_name': ['Тургенев', 'Чехов', 'Островский'], 'author_id': [1,2,3]}

In [3]:
authors = pd.DataFrame(data)

In [4]:
authors

  author_name  author_id
0    Тургенев          1
1       Чехов          2
2  Островский          3

In [5]:
data = {'author_id': [1, 1, 1, 2, 2, 3, 3],'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
        'price': [450, 300, 350, 500, 450, 370, 290] }

In [6]:
 book = pd.DataFrame(data)

In [7]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### task_2

In [8]:
authors_price = book.merge(authors, 'left', on = 'author_id')

In [9]:
authors_price

   author_id            book_title  price author_name
0          1           Отцы и дети    450    Тургенев
1          1                 Рудин    300    Тургенев
2          1     Дворянское гнездо    350    Тургенев
3          2      Толстый и тонкий    500       Чехов
4          2       Дама с собачкой    450       Чехов
5          3                 Гроза    370  Островский
6          3  Таланты и поклонники    290  Островский

### task_3

In [10]:
authors_price.sort_values(by = 'price', ascending= False).head(5)

   author_id         book_title  price author_name
3          2   Толстый и тонкий    500       Чехов
0          1        Отцы и дети    450    Тургенев
4          2    Дама с собачкой    450       Чехов
5          3              Гроза    370  Островский
2          1  Дворянское гнездо    350    Тургенев

### task_4

In [11]:
data = {'author_name':[], 'min_price':[], 'max_price':[], 'mean_price' : []}

In [12]:
for author in authors_price['author_name'].unique() :
    price_min = authors_price.groupby('author_name').min()['price'][author]
    price_mean = authors_price.groupby('author_name').mean()['price'][author]
    price_max = authors_price.groupby('author_name').max()['price'][author]
    data['author_name'].append([author])
    data['min_price'].append([price_min])
    data['max_price'].append([price_max])
    data['mean_price'].append([price_mean])

In [13]:
authors_stat = pd.DataFrame(data)

In [14]:
authors_stat

    author_name min_price max_price           mean_price
0    [Тургенев]     [300]     [450]  [366.6666666666667]
1       [Чехов]     [450]     [500]              [475.0]
2  [Островский]     [290]     [370]              [330.0]

### task_5

In [15]:
import numpy as np

In [16]:
authors_price.insert(4,'cover', ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'])

In [17]:
book_info = authors_price.pivot_table(index=['author_name'], columns = ['cover'], values = ['price'], aggfunc = np.sum, 
    fill_value = 0)

In [19]:
book_info.to_pickle("book_info.pkl")

In [20]:
book_info2 = pd.read_pickle("book_info.pkl")

In [21]:
book_info == book_info2

             price
cover       мягкая твердая
author_name
Островский    True    True
Тургенев      True    True
Чехов         True    True